analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
   </registers>
  </peripheral>
<!--MSRADC Magnetic Strip Reader - 9 bit ADC-->
  <peripheral>
   <name>FCR</name>
   <description>Function Control Register.</description>
   <baseAddress>0x40000800</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>FCTRL0</name>
     <description>Register 0.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>USBCLKSEL</name>
       <description>USB External Core Clock Select.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>sys</name>
         <description>Generated clock from system clock.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dig</name>
         <description>Digital clock from a GPIO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C0DGEN0</name>
       <description>I2C0 SDA Glitch Filter Enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C0DGEN1</name>
       <description>I2C0 SCL Glitch Filter Enable.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C1DGEN0</name>
       <description>I2C1 SDA Glitch Filter Enable.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>I2C1DGEN1</name>
       <description>I2C1 SCL Glitch Filter Enable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Filter disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Filter enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>FCTRL1</name>
     <description>Register 1.</description>
     <addressOffset>0x04</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>AC_EN</name>
       <description>Auto-calibration Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disabled.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enabled.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AC_RUN</name>
       <description>Autocalibration Run.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LOAD</name>
       <description>Load Trim.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>INV_GAIN</name>
       <description>Invert Gain.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ATOMIC</name>
       <description>Atomic mode.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>not</name>
         <description>Not Running.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>run</name>
         <description>Running.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MU</name>
       <description>MU value.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>12</bitWidth>
      </field>
      <field>
       <name>AC_TRIM</name>
       <description>150MHz HFIO Auto Calibration Trim</description>
       <bitOffset>23</bitOffset>
       <bitWidth>9</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FCTRL3</name>
     <description>Register 3.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>DONECNT</name>
       <description>Auto-calibration Done Counter Setting.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>URVBOOTADDR</name>
     <description>Register 4.</description>
     <addressOffset>0x10</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>BOOTADDR</name>
       <description>RISCV Boot Address.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>URVCTRL</name>
     <description>Register 5.</description>
     <addressOffset>0x14</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>SLEEP_REQ</name>
       <description>Sleep Request to RISCV.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SLEEP_ACK</name>
       <description>Acknowledgement of Sleep Request for RISCV.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>GP</name>
     <description>General Purpose Register.</description>
     <addressOffset>0x1C</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>GP</name>
       <description>General Purpose.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>TRIMCTRL</name>
     <description>MSR ADC Trim Register.</description>
     <addressOffset>0x20</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>MSR_R1</name>
       <description>MSR R1</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0K</name>
         <description>0kOhm</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>1P2K</name>
         <description>1.2kOhm</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>2P4K</name>
         <description>2.4kOhm</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4P8K</name>
         <description>4.8kOhm</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MSR_R2</name>
       <description>MSR R2</description>
       <bitOffset>2</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>OPEN</name>
         <description>Open drain.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>3K</name>
         <description>3kOhm</description>
         <value>4</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>6K</name>
         <description>6kOhm</description>
         <value>5</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>12K</name>
         <description>12kOhm</description>
         <value>6</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>24K</name>
         <description>24kOhm</description>
         <value>7</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>ERFOKS</name>
     <description>ERFO Kick Start Register.</description>
     <addressOffset>0x24</addressOffset>
     <access>read-write</access>
     <fields>
      <field>
       <name>CTRL</name>
       <description>Kick Start Control.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
