analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
   </registers>
  </peripheral>
<!--FCR Function Control Register.-->
  <peripheral>
   <name>TRIMSIR</name>
   <description>Trim System Initilazation Registers</description>
   <baseAddress>0x40005400</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>BBSIR2</name>
     <description>System Init. Configuration Register 2.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-only</access>
    </register>
    <register>
     <name>BBSIR3</name>
     <description>System Init. Configuration Register 3.</description>
     <addressOffset>0x0C</addressOffset>
     <access>read-only</access>
    </register>
   </registers>
  </peripheral>
<!--TRIMSIR Trim System Initilazation Registers-->
  <peripheral>
   <name>MCR</name>
   <description>Misc Control.</description>
   <baseAddress>0x40006C00</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>PDOWN</name>
     <description>PDOWN Drive Strength</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>PDOWNDS</name>
       <description>PDOWN Drive Strength</description>
       <bitOffset>0</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>PDOWNVS</name>
       <description>PDOWN Voltage Select</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>Misc Power State Control Register</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>VDDCSW</name>
       <description>Controls switching of VCORE</description>
       <bitOffset>1</bitOffset>
       <bitWidth>2</bitWidth>
      </field>
      <field>
       <name>USBSWEN_N</name>
       <description>USB Switch Control</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>off</name>
         <description>USB SW off in LP modes</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>on</name>
         <description>USB SW On</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>P1M</name>
       <description>Enable the Reset Pad Pull Up Resistors</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>1m</name>
         <description>1MOhm Pullup</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>25k</name>
         <description>25kOhm Pullup.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>rstn_voltage_sel</name>
       <description>Error! Description not Found!</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CLKCTRL</name>
     <description>Clock Control Register.</description>
     <addressOffset>0x14</addressOffset>
     <fields>
      <field>
       <name>ERTCO_PD</name>
       <description>32kHz Crystal Oscillator Power Down.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ERTCO_EN</name>
       <description>32kHz Crystal Oscillator Enable.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RST</name>
     <description>Reset Register.</description>
     <addressOffset>0x18</addressOffset>
     <fields>
      <field>
       <name>RTC</name>
       <description>Real Time Cock Reset.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>RTCTRIM</name>
     <description>RTC Trim Register.</description>
     <addressOffset>0x1C</addressOffset>
     <fields>
      <field>
       <name>TRIM_X1</name>
       <description>RTC Trim X1</description>
       <bitOffset>0</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>TRIM_X2</name>
       <description>RTC TRIM X2</description>
       <bitOffset>8</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LDOCTRL</name>
     <description>LDO Control Register.</description>
     <addressOffset>0x60</addressOffset>
     <fields>
      <field>
       <name>0P9V_EN</name>
       <description>LDO 0.9V Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>PWRMONST</name>
     <description>Power Monitor Statuses Register.</description>
     <addressOffset>0x64</addressOffset>
     <fields>
      <field>
       <name>PORZ_VLOSS</name>
       <description>Sticky bit indicating power on status of core power domains.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PORZ_VBAT</name>
       <description>Sticky bit indicating power on status of the battery.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PORZ_VRTC</name>
       <description>Sticky bit indicating power on status of the RTC.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PORZ_VDDC</name>
       <description>Sticky bit indicating power on status of VCORE.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PORZ_VDDA</name>
       <description>Sticky bit indicating power on status of VDDA.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PORZ_VDDB</name>
       <description>Sticky bit indicating power on status of VDDB.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDC</name>
       <description>Sticky bit indicating reset condition on VCORE.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDA</name>
       <description>Sticky bit indicating reset condition on VDDA.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDB</name>
       <description>Sticky bit indicating reset condition on VDDB.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDIO</name>
       <description>Sticky bit indicating reset condition on VDDIO.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDIOH</name>
       <description>Sticky bit indicating reset condition on VDDIOH.</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VRTC</name>
       <description>Sticky bit indicating reset condition on RTC.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_LDO_0P9V</name>
       <description>Non-sticky bit indicating reset condition on 0.9V USB supply.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDCA</name>
       <description>Non-sticky bit indicating reset condition on VCORE in Analog supply.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VCOREHV</name>
       <description>Non-sticky bit indicating high voltage reset condition on VCORE supply.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDIOHV</name>
       <description>Non-sticky bit indicating high voltage reset condition on VDDIO supply.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RSTZ_VDDIOHHV</name>
       <description>Non-sticky bit indicating high voltage reset condition on VDDIOH supply.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
