analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
   </registers>
  </peripheral>
<!--GPIO0 Individual I/O for each GPIO-->
  <peripheral derivedFrom="GPIO0">
   <name>GPIO1</name>
   <description>Individual I/O for each GPIO 1</description>
   <baseAddress>0x40009000</baseAddress>
   <interrupt>
    <name>GPIO1</name>
    <description>GPIO1 IRQ</description>
    <value>25</value>
   </interrupt>
  </peripheral>
<!--GPIO1 Individual I/O for each GPIO 1-->
  <peripheral>
   <name>HTMR</name>
   <description>High Speed Timer Module.</description>
   <baseAddress>0x4001B000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0xFFF</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>HTimer</name>
    <description>HTimer interrupt.</description>
    <value>93</value>
   </interrupt>
   <registers>
    <register>
     <name>LNICNT</name>
     <description>HTimer Long-Interval Counter. This register contains the 32 most significant bits of the counter.</description>
     <addressOffset>0x00</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>CNT</name>
       <description>HTimer Long Interval Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SHICNT</name>
     <description>HTimer Short Interval Counter. This counter ticks every t_htclk (16.48uS). HTIMER_SEC is incremented when this register rolls over from 0xFF to 0x00.</description>
     <addressOffset>0x04</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>CNT</name>
       <description>HTimer Short Interval Counter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>LNIALM</name>
     <description>HTimer Long Interval Alarm Value Register.</description>
     <addressOffset>0x08</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>ALM</name>
       <description>HTimer Long Interval Alarm. An Alarm is triggered when this value matches HTIMER_SEC[19:0]</description>
       <bitOffset>0</bitOffset>
       <bitWidth>20</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SHIALM</name>
     <description>HTimer Short Interval Alarm Value Register.</description>
     <addressOffset>0x0C</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>ALM</name>
       <description>This register contains the reload value for the short interval alarm.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL</name>
     <description>HTimer Control Register.</description>
     <addressOffset>0x10</addressOffset>
     <resetValue>0x00000008</resetValue>
     <resetMask>0xFFFFFF38</resetMask>
     <fields>
      <field>
       <name>EN</name>
       <description>HTimer Enable. This bit enables the Real Time Clock. This bit can only be written when WE=1 and BUSY =0. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LONG_ALM_IE</name>
       <description>Long Interval Alarm Interrupt Enable. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SHORT_ALM_IE</name>
       <description>Short Interval Alarm Interrupt Enable.  Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BUSY</name>
       <description>HTimer Busy. This bit is set to 1 by hardware when changes to HTimer registers required a synchronized version of the register to be in place.  This bit is automatically cleared by hardware.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>idle</name>
         <description>Idle.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>busy</name>
         <description>Busy.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY</name>
       <description>HTimer Ready. This bit is set to 1 by hardware when the HTimer count registers update.  It can be cleared to 0 by software at any time. It will also be cleared to 0 by hardware just prior to an update of the HTimer count register.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>busy</name>
         <description>Register has not updated.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>ready</name>
         <description>Ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RDY_IE</name>
       <description>HTimer Ready Interrupt Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LONG_ALM_IF</name>
       <description>Long Interval Alarm Interrupt Flag.  This alarm is qualified as wake-up source to the processor.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>Not active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>pending</name>
         <description>Active.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SHORT_ALM_IF</name>
       <description>Short Interval Alarm Interrupt Flag. This alarm is qualified as wake-up source to the processor.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>inactive</name>
         <description>Not active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Pending</name>
         <description>Active.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>WR_EN</name>
       <description>Write Enable. This register bit serves as a protection mechanism against unintentional writes to critical HTimer bits.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Not active.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>TRIM</name>
     <description>HTimer Trim Register.</description>
     <addressOffset>0x14</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>TRIM</name>
       <description>HTimer Trim. This register contains the 2's complement value that specifies the trim resolution. Each increment or decrement of the bit adds or subtracts 1ppm at each 4KHz clock value, with a maximum correction of +/- 127ppm.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>8</bitWidth>
      </field>
      <field>
       <name>VBAT_TMR</name>
       <description>VBAT Timer Value. When HTimer is running off of VBAT, this field is incremented every 32 seconds.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>24</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>OSCCTRL</name>
     <description>HTimer Oscillator Control Register.</description>
     <addressOffset>0x18</addressOffset>
     <resetMask>0x00000000</resetMask>
     <fields>
      <field>
       <name>FILTER_EN</name>
       <description>Enable Filter.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IBIAS_SEL</name>
       <description>IBIAS Select.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>2x</name>
         <description>2x</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4x</name>
         <description>4x</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HYST_EN</name>
       <description>HTimer Hysteresis Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>IBIAS_EN</name>
       <description>HTimer IBIAS Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>BYPASS</name>
       <description>HTimer Crystal Bypass</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SQW_32K</name>
       <description>HTimer 32kHz Square Wave Output</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
