analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
   </registers>
  </peripheral>
<!--RTC Real Time Clock and Alarm.-->
  <peripheral>
   <name>SIR</name>
   <description>System Initialization Registers.</description>
   <baseAddress>0x40000400</baseAddress>
   <access>read-only</access>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x400</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>SISTAT</name>
     <description>System Initialization Status Register.</description>
     <addressOffset>0x00</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>MAGIC</name>
       <description>Magic Word Validation.  This bit is set by the system initialization block following power-up.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>magicNotSet</name>
         <description>Magic word was not set (OTP has not been initialized properly).</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>magicSet</name>
         <description>Magic word was set (OTP contains valid settings).</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>CRCERR</name>
       <description>CRC Error Status.  This bit is set by the system initialization block following power-up.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <usage>read</usage>
        <enumeratedValue>
         <name>noError</name>
         <description>No CRC errors occurred during the read of the OTP memory block.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>error</name>
         <description>A CRC error occurred while reading the OTP. The address of the failure location in the OTP memory is stored in the ERRADDR register.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SIADDR</name>
     <description>Read-only field set by the SIB block if a CRC error occurs during the read of the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
     <addressOffset>0x04</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>ERRADDR</name>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FSTAT</name>
     <description>funcstat register.</description>
     <addressOffset>0x100</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>FPU</name>
       <description>FPU Function.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>USB</name>
       <description>USB Device.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADC</name>
       <description>10-bit Sigma Delta ADC.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SPIXIP</name>
       <description>SPIXIPffunction.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ADC9</name>
       <description>ADC9 function.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SC</name>
       <description>SC function.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>NMI</name>
       <description>NMI function.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>SFSTAT</name>
     <description>Security Function </description>
     <addressOffset>0x104</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>SECBOOT</name>
       <description>Secure Boot Disable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SERLOAD</name>
       <description>Serial Load Disable function.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TRNG</name>
       <description>TRNG function.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>AES</name>
       <description>AES function.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SHA</name>
       <description>SHA function.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SECMODE</name>
       <description>Security Mode Disable.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>no</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>yes</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
