analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
   </registers>
  </peripheral>
<!--SMON The Security Monitor block used to monitor system threat conditions.-->
  <peripheral>
   <name>SPIXFC</name>
   <description>SPI XiP Flash Configuration Controller</description>
   <baseAddress>0x40027000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>SPIXFC</name>
    <description>SPIXFC IRQ</description>
    <value>38</value>
   </interrupt>
   <registers>
    <register>
     <name>CTRL0</name>
     <description>Control Register.</description>
     <addressOffset>0x00</addressOffset>
     <fields>
      <field>
       <name>SSEL</name>
       <description>Slaves Select.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Slave_0</name>
         <description>Slave 0 is selected.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Slave_1</name>
         <description>Slave 1 is selected.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>THREE_WIRE</name>
       <description>Three Wire Mode.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MODE</name>
       <description>Defines SPI Mode, Only valid values are 0 and 3.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>SPI_Mode_0</name>
         <description>SPIX Mode 0. CLK Polarity = 0, CLK Phase = 0.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SPI_Mode_3</name>
         <description>SPIX Mode 3. CLK Polarity = 1, CLK Phase = 1.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>PGSZ</name>
       <description>Page Size.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>4_bytes</name>
         <description>4 bytes.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8_bytes</name>
         <description>8 bytes.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>16_bytes</name>
         <description>16 bytes.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>32_bytes</name>
         <description>32 bytes.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HICLK</name>
       <description>SCLK High Clocks. Number of system clocks that SCLK will be high when SCLK pulses are generated. 0 Correspond to 16 system clocks and, all other values defines the number of system clock taht SCLK will be held high.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>4</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>16_SCLK</name>
         <description>16 system clocks.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>LOCLK</name>
       <description>SCLK low Clocks. Number of system clocks that SCLK will be low when SCLK pulses are generated. 0 correspond to 16 system clocks and, all other values defines the number of system clock taht SCLK will be held low.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>4</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>16_SCLK</name>
         <description>16 system clocks.</description>
         <value>0</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SSACT</name>
       <description>Slaves Select Activate Timing.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>0_CLKS</name>
         <description>0 sytem clocks.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>2_CLKS</name>
         <description>2 sytem clocks.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>4_CLKS</name>
         <description>4 sytem clocks.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8_CLKS</name>
         <description>8 sytem clocks.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SSINACT</name>
       <description>Slaves Select Inactive Timing.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>2</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>4_CLKS</name>
         <description>4 sytem clocks.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>6_CLKS</name>
         <description>6 sytem clocks.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>8_CLKS</name>
         <description>8 sytem clocks.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>12_CLKS</name>
         <description>12 sytem clocks.</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>IOSMPL</name>
       <description>Sample Delay</description>
       <bitOffset>20</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>SSPOL</name>
     <description>SPIX Controller Slave Select Polarity Register.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>SSPOL</name>
       <description>Slave Select Polarity.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>lo</name>
         <description>Active Low.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>hi</name>
         <description>Active High.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FCPOL</name>
       <description>FC Polarity.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>lo</name>
         <description>Active Low.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>hi</name>
         <description>Active High.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL1</name>
     <description>SPIX Controller General Controller Register.</description>
     <addressOffset>0x08</addressOffset>
     <fields>
      <field>
       <name>EN</name>
       <description>SPI Master enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable SPI Master, putting a reset state.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable SPI Master for processing transactions.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_FIFO_EN</name>
       <description>Transaction FIFO Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis_txfifo</name>
         <description>Disable Transaction FIFO.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en_txfifo</name>
         <description>Enable Transaction FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_FIFO_EN</name>
       <description>Result FIFO Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>DIS_RXFIFO</name>
         <description>Disable Result FIFO.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>EN_RXFIFO</name>
         <description>Enable Result FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BB_EN</name>
       <description>Bit-Bang Mode.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable Bit-Bang Mode.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>en</name>
         <description>Enable Bit-Bang Mode.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SSDR</name>
       <description>This bits reflects the state of the currently selected slave select.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>output0</name>
         <description>Selected Slave select output = 0.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>output1</name>
         <description>Selected Slave select output = 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FCDR</name>
       <description>This bits reflects the state of the selected FC.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SCLKDR</name>
       <description>SCLK Drive and State.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>SCLK_0</name>
         <description>SCLK is 0.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SCLK_1</name>
         <description>SCLK is 1.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SDIO_DATA_IN</name>
       <description>SDIO Input Data Value.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>4</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>SDIO0</name>
         <description>SDIO[0]</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO1</name>
         <description>SDIO[1]</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO2</name>
         <description>SDIO[2]</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO3</name>
         <description>SDIO[3]</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BB_DATA_OUT</name>
       <description>Bit Bang SDIO Output.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>4</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>SDIO0</name>
         <description>SDIO[0]</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO1</name>
         <description>SDIO[1]</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO2</name>
         <description>SDIO[2]</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO3</name>
         <description>SDIO[3]</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>BB_DATA_OUT_EN</name>
       <description>Bit Bang SDIO Output Enable.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>4</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>SDIO0</name>
         <description>SDIO[0]</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO1</name>
         <description>SDIO[1]</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO2</name>
         <description>SDIO[2]</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SDIO3</name>
         <description>SDIO[3]</description>
         <value>3</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SIMPLE_EN</name>
       <description>Simple Mode Enable.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SIMPLE_RX</name>
       <description>Simple Receive Enable.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SIMPLE_SS</name>
       <description>Simple Mode Slave Select.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SCLK_FB</name>
       <description>Enable SCLK Feedback Mode.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Dis</name>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>En</name>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>SCLK_FB_INV</name>
       <description>SCK Invert.</description>
       <bitOffset>25</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL2</name>
     <description>SPIX Controller FIFO Control and Status Register.</description>
     <addressOffset>0x0C</addressOffset>
     <fields>
      <field>
       <name>TX_AE_LVL</name>
       <description>Transaction FIFO Almost Empty Level.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>TX_CNT</name>
       <description>Transaction FIFO Used.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>RX_AF_LVL</name>
       <description>Results FIFO Almost Full Level.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>RX_CNT</name>
       <description>Result FIFO Used.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>6</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTRL3</name>
     <description>SPIX Controller Special Control Register.</description>
     <addressOffset>0x10</addressOffset>
     <fields>
      <field>
       <name>SAMPLE</name>
       <description>Setting this bit to a 1 enables the ability to drive SDIO outputs prior to the assertion of Slave Select. This bit must
                                                                         only be set when the SPIXF bus is idle and the transaction FIFO is empty. This bit is automatically cleared by hardware after the
                                                                         next slave select assertion.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MISO_FC_EN</name>
       <description>MISO FC Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SDIO_OUT_VAL</name>
       <description>SDIO Output Value Sample Mode</description>
       <bitOffset>4</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>SDIO_OUT_EN</name>
       <description>SDIO Output Enable Sample Mode</description>
       <bitOffset>8</bitOffset>
       <bitWidth>4</bitWidth>
      </field>
      <field>
       <name>SCLKINH3</name>
       <description>SCLK Inhibit Mode3. In SPI Mode 3, some SPI flash read timing diagrams show the last SCLK going low prior to de-assertion. The default is to support this additional falling edge of clock. When this bit is set and the device is in SPI Mode 3, the SPI clock is held high while Slave Select is de-asserted. This is to support some SPI flash write timing diagrams.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Allow trailing SCLK low pulse prior to Slave Select de-assertion.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Inhibit trailing SCLK low pulse prior to Slave Select de-assertion.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>INTFL</name>
     <description>SPIX Controller Interrupt Status Register.</description>
     <addressOffset>0x14</addressOffset>
     <fields>
      <field>
       <name>TX_STALLED</name>
       <description>Transaction Stalled Interrupt Flag.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>CLR</name>
         <description>Normal FIFO Transaction.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SET</name>
         <description>Stalled FIFO Transaction.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_STALLED</name>
       <description>Results Stalled Interrupt Flag.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>CLR</name>
         <description>Normal FIFO Operation.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SET</name>
         <description>Stalled FIFO.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_RDY</name>
       <description>Transaction Ready Interrupt Status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>CLR</name>
         <description>FIFO Transaction not ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SET</name>
         <description>FIFO Transaction ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_DONE</name>
       <description>Results Done Interrupt Status.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>CLR</name>
         <description>Results FIFO ready.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SET</name>
         <description>Results FIFO Not ready.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_AE</name>
       <description>Transaction FIFO Almost Empty Flag.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>CLR</name>
         <description>Transaction FIFO not Almost Empty.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SET</name>
         <description>Transaction FIFO Almost Empty.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_AF</name>
       <description>Results FIFO Almost Full Flag.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>CLR</name>
         <description>Results FIFO level below the Almost Full level.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>SET</name>
         <description>Results FIFO level at Almost Full level.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
