analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
    <register>
     <name>INTEN</name>
     <description>SPIX Controller Interrupt Enable Register.</description>
     <addressOffset>0x18</addressOffset>
     <fields>
      <field>
       <name>TX_STALLED</name>
       <description>Transaction Stalled Interrupt Enable.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Disable Transaction Stalled Interrupt.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Enable Transaction Stalled Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_STALLED</name>
       <description>Results Stalled Interrupt Enable.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Disable Results Stalled Interrupt.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Enable Results Stalled Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_RDY</name>
       <description>Transaction Ready Interrupt Enable.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Disable FIFO Transaction Ready Interrupt.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Enable FIFO Transaction Ready Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_DONE</name>
       <description>Results Done Interrupt Enable.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Disable Results Done Interrupt.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Enable Results Done Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>TX_AE</name>
       <description>Transaction FIFO Almost Empty Interrupt Enable.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Disable Transaction FIFO Almost Empty Interrupt.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Enable Transaction FIFO Almost Empty Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>RX_AF</name>
       <description>Results FIFO Almost Full Interrupt Enable.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>EN</name>
         <description>Disable Results FIFO Almost Full Interrupt.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>DIS</name>
         <description>Enable Results FIFO Almost Full Interrupt.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>HEADER</name>
     <description>Simple Header</description>
     <addressOffset>0x1C</addressOffset>
     <fields>
      <field>
       <name>TX_BIDIR</name>
       <description>TX Bdirectional Header.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
      <field>
       <name>RX_ONLY</name>
       <description>RX Only Header.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>14</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>AUTOCTRL</name>
     <description>Auto Control Register.</description>
     <addressOffset>0x20</addressOffset>
    </register>
    <register>
     <name>AUTOCMD</name>
     <description>Auto Command Register.</description>
     <addressOffset>0x24</addressOffset>
    </register>
   </registers>
  </peripheral>
<!--SPIXFC SPI XiP Flash Configuration Controller-->
  <peripheral>
   <name>SPIXFC_FIFO</name>
   <description>SPI XiP Master Controller FIFO.</description>
   <baseAddress>0x400BC000</baseAddress>
   <addressBlock>
    <offset>0</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <registers>
    <register>
     <name>TX_8</name>
     <description>SPI TX FIFO 8-Bit Write</description>
     <addressOffset>0x00</addressOffset>
     <size>8</size>
     <dataType>uint8_t</dataType>
    </register>
    <register>
     <name>TX_16</name>
     <description>SPI TX FIFO 16-Bit Write</description>
     <alternateRegister>TX_8</alternateRegister>
     <addressOffset>0x00</addressOffset>
     <size>16</size>
     <dataType>uint16_t</dataType>
    </register>
    <register>
     <name>TX_32</name>
     <description>SPI TX FIFO 32-Bit Write</description>
     <alternateRegister>TX_8</alternateRegister>
     <addressOffset>0x00</addressOffset>
     <size>32</size>
     <dataType>uint32_t</dataType>
    </register>
    <register>
     <name>RX_8</name>
     <description>SPI RX FIFO 8-Bit Access</description>
     <addressOffset>0x04</addressOffset>
     <size>8</size>
     <dataType>uint8_t</dataType>
    </register>
    <register>
     <name>RX_16</name>
     <description>SPI RX FIFO 16-Bit Access</description>
     <alternateRegister>RX_8</alternateRegister>
     <addressOffset>0x04</addressOffset>
     <size>16</size>
     <dataType>uint16_t</dataType>
    </register>
    <register>
     <name>RX_32</name>
     <description>SPI RX FIFO 32-Bit Access</description>
     <alternateRegister>RX_8</alternateRegister>
     <addressOffset>0x04</addressOffset>
     <size>32</size>
     <dataType>uint32_t</dataType>
    </register>
