analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
   </registers>
  </peripheral>
<!--TMR0 32-bit reloadable timer that can be used for timing and event counting.-->
  <peripheral derivedFrom="TMR0">
   <name>TMR1</name>
   <description>32-bit reloadable timer that can be used for timing and event counting. 1</description>
   <baseAddress>0x40011000</baseAddress>
   <interrupt>
    <name>TMR1</name>
    <description>TMR1 IRQ</description>
    <value>6</value>
   </interrupt>
  </peripheral>
<!--TMR1 32-bit reloadable timer that can be used for timing and event counting. 1-->
  <peripheral derivedFrom="TMR0">
   <name>TMR2</name>
   <description>32-bit reloadable timer that can be used for timing and event counting. 2</description>
   <baseAddress>0x40012000</baseAddress>
   <interrupt>
    <name>TMR2</name>
    <description>TMR2 IRQ</description>
    <value>7</value>
   </interrupt>
  </peripheral>
<!--TMR2 32-bit reloadable timer that can be used for timing and event counting. 2-->
  <peripheral derivedFrom="TMR0">
   <name>TMR3</name>
   <description>32-bit reloadable timer that can be used for timing and event counting. 3</description>
   <baseAddress>0x40013000</baseAddress>
   <interrupt>
    <name>TMR3</name>
    <description>TMR3 IRQ</description>
    <value>8</value>
   </interrupt>
  </peripheral>
<!--TMR3 32-bit reloadable timer that can be used for timing and event counting. 3-->
  <peripheral derivedFrom="TMR0">
   <name>TMR4</name>
   <description>32-bit reloadable timer that can be used for timing and event counting. 4</description>
   <baseAddress>0x40014000</baseAddress>
   <interrupt>
    <name>TMR4</name>
    <description>TMR4 IRQ</description>
    <value>9</value>
   </interrupt>
  </peripheral>
<!--TMR4 32-bit reloadable timer that can be used for timing and event counting. 4-->
  <peripheral derivedFrom="TMR0">
   <name>TMR5</name>
   <description>32-bit reloadable timer that can be used for timing and event counting. 5</description>
   <baseAddress>0x40015000</baseAddress>
   <interrupt>
    <name>TMR5</name>
    <description>TMR5 IRQ</description>
    <value>10</value>
   </interrupt>
  </peripheral>
<!--TMR5 32-bit reloadable timer that can be used for timing and event counting. 5-->
  <peripheral>
   <name>TRNG</name>
   <description>Random Number Generator.</description>
   <baseAddress>0x4004D000</baseAddress>
   <addressBlock>
    <offset>0x00</offset>
    <size>0x1000</size>
    <usage>registers</usage>
   </addressBlock>
   <interrupt>
    <name>TRNG</name>
    <description>TRNG interrupt.</description>
    <value>4</value>
   </interrupt>
   <registers>
    <register>
     <name>CTRL</name>
     <description>TRNG Control Register.</description>
     <addressOffset>0x00</addressOffset>
     <resetValue>0x00000003</resetValue>
     <fields>
      <field>
       <name>OD_HEALTH</name>
       <description>Start On-Demand health test.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RND_IE</name>
       <description>To enable IRQ generation when a new 32-bit Random number is ready.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>disable</name>
         <description>Disable</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>enable</name>
         <description>Enable</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>HEALTH_IE</name>
       <description>Enable IRQ generation when a health test fails.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>MEU_KEYGEN</name>
       <description>If set to 1, the TRNG generates the 256-bit AES MEU keys.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>XIP_KEYGEN</name>
       <description>If set to 1, the TRNG generates the 128-bit QSPI (XIP) keys.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>OD_ROMON</name>
       <description>Start ring oscillator monitor on demand test.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>OD_EE</name>
       <description>Start entropy estimator on demand test.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_EE_FOE</name>
       <description>Ring Oscillator Monitors and Entropy Estimator Freeze on Error.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_EE_FOD</name>
       <description>Ring Oscillator Monitors and Entropy Estimator Freeze on Done.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EBLS</name>
       <description>Entropy Bit Load Select.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>KEYWIPE</name>
       <description>To wipe the Battery Backed key.</description>
       <bitOffset>15</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>GET_TERO_CNT</name>
       <description>Get Tero Count.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EE_DONE_IE</name>
       <description>Entropy Estimator Done Interrupt Enable.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_DIS</name>
       <description>Ring Oscillator Disable.</description>
       <bitOffset>24</bitOffset>
       <bitWidth>3</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>RO_0</name>
         <description>Ring Oscillator 0.</description>
         <value>1</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RO_1</name>
         <description>Ring Oscillator 1.</description>
         <value>2</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>RO_2</name>
         <description>Ring Oscillator 2.</description>
         <value>4</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>STATUS</name>
     <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
     <addressOffset>0x04</addressOffset>
     <fields>
      <field>
       <name>RDY</name>
       <description>32-bit random data is ready to read from TRNG_DATA register. Reading TRNG_DATA when RND_RDY=0 will return all 0's. IRQ is generated when RND_RDY=1 if TRNG_CN.RND_IRQ_EN=1.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <enumeratedValues>
        <enumeratedValue>
         <name>Busy</name>
         <description>TRNG Busy</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>Ready</name>
         <description>32 bit random data is ready</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>OD_HEALTH</name>
       <description>On-Demand health test status.</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HEALTH</name>
       <description>Health test status.</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>SRCFAIL</name>
       <description>Entropy source has failed.</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AES_KEYGEN</name>
       <description>AESKGD.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>OD_ROMON</name>
       <description>On demand ring oscillator test status.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>OD_EE</name>
       <description>On demand entropy estimator status.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>PP_ERR</name>
       <description>Post process error.</description>
       <bitOffset>8</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_0_ERR</name>
       <description>Ring Oscillator 0 Monitor Error.</description>
       <bitOffset>9</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_1_ERR</name>
       <description>Ring Oscillator 1 Monitor Error.</description>
       <bitOffset>10</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_2_ERR</name>
       <description>Ring Oscillator 2 Monitor Error.</description>
       <bitOffset>11</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EE_ERR_THR</name>
       <description>Entropy Estimator Threshold Error.</description>
       <bitOffset>12</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EE_ERR_OOB</name>
       <description>Entropy Estimator Out of Bounds Error..</description>
       <bitOffset>13</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EE_ERR_LOCK</name>
       <description>Entropy Estimator Lock Error.</description>
       <bitOffset>14</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>TERO_CNT_RDY</name>
       <description>TERO Count Ready.</description>
       <bitOffset>16</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>RC_ERR</name>
       <description>Repetition Count Error.</description>
       <bitOffset>17</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>AP_ERR</name>
       <description>Adaptive Proportion Error.</description>
       <bitOffset>18</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_DONE</name>
       <description>Data register has been loaded with at least 32 new entropy bits.</description>
       <bitOffset>19</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>DATA_NIST_DONE</name>
       <description>Data NIST register has been loaded with at least 32 new entropy bits.</description>
       <bitOffset>20</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>HEALTH_DONE</name>
       <description>Health Test Done.</description>
       <bitOffset>21</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>ROMON_DONE</name>
       <description>Ring Oscillator Monitor Test Done.</description>
       <bitOffset>22</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>EE_DONE</name>
       <description>Entropy Estimator Test Done.</description>
       <bitOffset>23</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DATA</name>
     <description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
     <addressOffset>0x08</addressOffset>
     <access>read-only</access>
     <fields>
      <field>
       <name>DATA</name>
       <description>Data. The content of this register is valid only when RNG_IS =1. When TNRG is disabled, read returns 0x0000 0000.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>DATA_NIST</name>
     <description>Data NIST Register.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>DATA</name>
       <description>Ring Oscillator 1 Monitor Last Ring Oscillator Count.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
