analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
    <register>
     <name>CSR0</name>
     <description>Control status register for EP 0 (when INDEX == 0).</description>
     <addressOffset>0x12</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>SERV_SETUP_END</name>
       <description>Clear EP0 Setup End Bit. Write a 1 to clear the setupend bit. Automatically cleared after being set </description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SERV_OUTPKTRDY</name>
       <description>Clear EP0 Out Packet Ready Bit. Write a 1 to clear the outpktrdy bit. Automatically cleared after being set.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SEND_STALL</name>
       <description>Send EP0 STALL Handshake. Write a 1 to this bit to terminate the current control transaction by sneding a STALL handshake. Automatically cleared after being set. </description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SETUP_END</name>
       <description>Read Setup End Status. Automatically set when a control transaction ends before the dataend bit has been set by firmware. An interrupt is generated when this bit is set. Write 1 to servicedsetupend to clear.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>DATA_END</name>
       <description>Control Transaction Data End. Write a 1 to this bit after firmware completes any of the following three transactions: 1. set inpktrdy = 1 for the last data packet. 2. Set inpktrdy =1 for a zero-length data packet. 3. Clear outpktrdy = 0 after unloading the last data packet. </description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SENT_STALL</name>
       <description> Read EP0 STALL Handshake Sent Status Automatically set when a STALL handshake is transmitted. Write a 0 to clear. </description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>INPKTRDY</name>
       <description>EP0 IN Packet Ready 1: Write a 1 after writing a data packet to the IN FIFO. Automatically cleared when the data packet is transmitted. An interrupt is generated when this bit is cleared. </description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>OUTPKTRDY</name>
       <description>EP0 OUT Packet Ready Status Automatically set when a data packet is received in the OUT FIFO. An interrupt is generated when this bit is set. Write a 1 to the servicedoutpktrdy bit (above) to clear after the packet is unloaded from the OUT FIFO. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INCSRL</name>
     <description>Control status lower register for INx endpoint (x == INDEX).</description>
     <alternateRegister>CSR0</alternateRegister>
     <addressOffset>0x12</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>INCOMPTX</name>
       <description>Read Incomplete Split Transfer Error Status High-bandwidth isochronous transfers: Automatically set when a payload is split into multiple packets but insufficient IN tokens were received to send all packets. The current packets is flushed from the IN FIFO. Write 0 to clear.</description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>CLRDATATOG</name>
       <description>Write 1 to clear IN endpoint data-toggle to 0.</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SENTSTALL</name>
       <description>Read STALL Handshake Sent Status Automatically set when a STALL handshake is transmitted, at which time the IN FIFO is flushed, and inpktrdy is cleared. Write 0 to clear.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SENDSTALL</name>
       <description>Send STALL Handshake.</description>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>terminate</name>
         <description>Terminate STALL handhsake</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>respond</name>
         <description>Respond to an IN token with a STALL handshake</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FLUSHFIFO</name>
       <description>Flush Next Packet from IN FIFO. Write 1 to clear</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>UNDERRUN</name>
       <description>Read IN FIFO Underrun Error Status Isochronous Mode: Automatically set if the IN FIFO is empty. Write 0 to clear</description>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>FIFONOTEMPTY</name>
       <description>Read FIFO Not Empty Status. Automatically set when there is at least one packet in the IN FIFO. Write a 0 to clear. </description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>INPKTRDY</name>
       <description>IN Packet Ready. Write a 1 to clear </description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>INCSRU</name>
     <description>Control status upper register for INx endpoint (x == INDEX).</description>
     <addressOffset>0x13</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>AUTOSET</name>
       <description>Auto Set inpktrdy. </description>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>set</name>
         <description>USBHS_INCSRL_inpktrdy must be set by firmware.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>auto</name>
         <description>USBHS_INCSRL_inpktrdy is automatically set. </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>ISO</name>
       <description>Isochronous Transfer Enable</description>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>interrupt</name>
         <description>Enable IN Bulk and IN interrupt transfers.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>isochronous</name>
         <description>Enable IN Isochronous transfers. </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>MODE</name>
       <description> Endpoint Direction Mode.</description>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>out</name>
         <description>Endpoint direction is OUT.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>in</name>
         <description>Endpoint direction is IN. </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>FRCDATATOG</name>
       <description> Force In Data - Toggle</description>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>received</name>
         <description>Toggle data-toglge only when an ACK is received.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dontcare</name>
         <description>Toggle data-toggle regardless of ACK. </description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
      <field>
       <name>DPKTBUFDIS</name>
       <description> Double Packet Buffering Disable </description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
       <enumeratedValues>
        <enumeratedValue>
         <name>en</name>
         <description>Enable Double packet buffering.</description>
         <value>0</value>
        </enumeratedValue>
        <enumeratedValue>
         <name>dis</name>
         <description>Disable Double Packet Buffering.</description>
         <value>1</value>
        </enumeratedValue>
       </enumeratedValues>
      </field>
     </fields>
    </register>
    <register>
     <name>OUTMAXP</name>
     <description>Maximum packet size for OUTx endpoint (x == INDEX).</description>
     <addressOffset>0x14</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>NUMPACKMINUS1</name>
       <description>Number of Split Packets -1. Defines the maximum number of packets - 1 that a usb payload is combined into. The value must be exact multiple of maxpacketsize. </description>
       <bitOffset>11</bitOffset>
       <bitWidth>5</bitWidth>
      </field>
      <field>
       <name>MAXPACKETSIZE</name>
       <description>Maximum Packet in a Single Transaction. This is the maximum packet size, in bytes, that is transmitted for each microframe. The maximum value is 1024, subject to the limitations for the endpoint type set in USB2.0 spesification, chapter 9.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>11</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>OUTCSRL</name>
     <description>Control status lower register for OUTx endpoint (x == INDEX).</description>
     <addressOffset>0x16</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>CLRDATATOG</name>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SENTSTALL</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>SENDSTALL</name>
       <bitOffset>5</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>FLUSHFIFO</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>DATAERROR</name>
       <bitOffset>3</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>OVERRUN</name>
       <bitOffset>2</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>FIFOFULL</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>OUTPKTRDY</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>OUTCSRU</name>
     <description>Control status upper register for OUTx endpoint (x == INDEX).</description>
     <addressOffset>0x17</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>AUTOCLEAR</name>
       <bitOffset>7</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>ISO</name>
       <bitOffset>6</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>DISNYET</name>
       <bitOffset>4</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>DPKTBUFDIS</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>INCOMPRX</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>COUNT0</name>
     <description>Number of received bytes in EP 0 FIFO (INDEX == 0).</description>
     <addressOffset>0x18</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>COUNT0</name>
       <description>Read Number of Data Bytes in the Endpoint 0 FIFO. Returns the number of data bytes in the endpoint 0 FIFO. This value changes as contents of the FIFO change. The value is only valued when USBHS_OUTSCRL_outpktrdy = 1 </description>
       <bitOffset>0</bitOffset>
       <bitWidth>7</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>OUTCOUNT</name>
     <description>Number of received bytes in OUT EPx FIFO (x == INDEX).</description>
     <alternateRegister>COUNT0</alternateRegister>
     <addressOffset>0x18</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>OUTCOUNT</name>
       <description>Read Number of Data Bytes in OUT FIFO. Returns the number of data bytes in the packet that are read next in the OUT FIFO. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>13</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO0</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x20</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO0</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO1</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x24</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO1</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO2</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x28</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO2</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO3</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x2c</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO3</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO4</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x30</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO4</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO5</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x34</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO5</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO6</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x38</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO6</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO7</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x3c</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO7</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO8</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x40</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO8</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO9</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x44</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO9</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO10</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x48</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO10</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO11</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x4c</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO11</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO12</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x50</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO12</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO13</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x54</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO13</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO14</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x58</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO14</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>FIFO15</name>
     <description>Read for OUT data FIFO, write for IN data FIFO.</description>
     <addressOffset>0x5c</addressOffset>
     <fields>
      <field>
       <name>USBHS_FIFO15</name>
       <description>USBHS Endpoint FIFO Read/Write Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>32</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>HWVERS</name>
     <description>HWVERS</description>
     <addressOffset>0x6c</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>USBHS_HWVERS</name>
       <description>USBHS Register.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>EPINFO</name>
     <description>Endpoint hardware information.</description>
     <addressOffset>0x78</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>OUTENDPOINTS</name>
       <bitOffset>4</bitOffset>
       <bitWidth>4</bitWidth>
       <access>read-only</access>
      </field>
      <field>
       <name>INTENDPOINTS</name>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>RAMINFO</name>
     <description>RAM width information.</description>
     <addressOffset>0x79</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>RAMBITS</name>
       <bitOffset>0</bitOffset>
       <bitWidth>4</bitWidth>
       <access>read-only</access>
      </field>
     </fields>
    </register>
    <register>
     <name>SOFTRESET</name>
     <description>Software reset register.</description>
     <addressOffset>0x7A</addressOffset>
     <size>8</size>
     <fields>
      <field>
       <name>RSTXS</name>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
      <field>
       <name>RSTS</name>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
       <access>read-write</access>
      </field>
     </fields>
    </register>
    <register>
     <name>CTUCH</name>
     <description>Chirp timeout timer setting.</description>
     <addressOffset>0x80</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>C_T_UCH</name>
       <description>HS Chirp Timeout Clock Cycles. This configures the chirp timeout used by this device to negotiate a HS connection with a FS Host. </description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>CTHSRTN</name>
     <description>Sets delay between HS resume to UTM normal operating mode.</description>
     <addressOffset>0x82</addressOffset>
     <size>16</size>
     <fields>
      <field>
       <name>C_T_HSTRN</name>
       <description>High Speed Resume Delay Clock Cycles. This configures the delay from when the RESUME state on the bus ends, the when the USBHS resumes normal operation.</description>
       <bitOffset>0</bitOffset>
       <bitWidth>16</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MXM_USB_REG_00</name>
     <description>MXM_USB_REG_00</description>
     <addressOffset>0x400</addressOffset>
    </register>
    <register>
     <name>M31_PHY_UTMI_RESET</name>
     <description>M31_PHY_UTMI_RESET</description>
     <addressOffset>0x404</addressOffset>
    </register>
