analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32572/Include/max32572.svd
    <register>
     <name>M31_PHY_UTMI_VCONTROL</name>
     <description>M31_PHY_UTMI_VCONTROL</description>
     <addressOffset>0x408</addressOffset>
    </register>
    <register>
     <name>M31_PHY_CLK_EN</name>
     <description>M31_PHY_CLK_EN</description>
     <addressOffset>0x40C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_PONRST</name>
     <description>M31_PHY_PONRST</description>
     <addressOffset>0x410</addressOffset>
    </register>
    <register>
     <name>M31_PHY_NONCRY_RSTB</name>
     <description>M31_PHY_NONCRY_RSTB</description>
     <addressOffset>0x414</addressOffset>
    </register>
    <register>
     <name>M31_PHY_NONCRY_EN</name>
     <description>M31_PHY_NONCRY_EN</description>
     <addressOffset>0x418</addressOffset>
    </register>
    <register>
     <name>M31_PHY_U2_COMPLIANCE_EN</name>
     <description>M31_PHY_U2_COMPLIANCE_EN</description>
     <addressOffset>0x420</addressOffset>
    </register>
    <register>
     <name>M31_PHY_U2_COMPLIANCE_DAC_ADJ</name>
     <description>M31_PHY_U2_COMPLIANCE_DAC_ADJ</description>
     <addressOffset>0x424</addressOffset>
    </register>
    <register>
     <name>M31_PHY_U2_COMPLIANCE_DAC_ADJ_EN</name>
     <description>M31_PHY_U2_COMPLIANCE_DAC_ADJ_EN</description>
     <addressOffset>0x428</addressOffset>
    </register>
    <register>
     <name>M31_PHY_CLK_RDY</name>
     <description>M31_PHY_CLK_RDY</description>
     <addressOffset>0x42C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_PLL_EN</name>
     <description>M31_PHY_PLL_EN</description>
     <addressOffset>0x430</addressOffset>
    </register>
    <register>
     <name>M31_PHY_BIST_OK</name>
     <description>M31_PHY_BIST_OK</description>
     <addressOffset>0x434</addressOffset>
    </register>
    <register>
     <name>M31_PHY_DATA_OE</name>
     <description>M31_PHY_DATA_OE</description>
     <addressOffset>0x438</addressOffset>
    </register>
    <register>
     <name>M31_PHY_OSCOUTEN</name>
     <description>M31_PHY_OSCOUTEN</description>
     <addressOffset>0x43C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_LPM_ALIVE</name>
     <description>M31_PHY_LPM_ALIVE</description>
     <addressOffset>0x440</addressOffset>
    </register>
    <register>
     <name>M31_PHY_HS_BIST_MODE</name>
     <description>M31_PHY_HS_BIST_MODE</description>
     <addressOffset>0x444</addressOffset>
    </register>
    <register>
     <name>M31_PHY_CORECLKIN</name>
     <description>M31_PHY_CORECLKIN</description>
     <addressOffset>0x448</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XTLSEL</name>
     <description>M31_PHY_XTLSEL</description>
     <addressOffset>0x44C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_LS_EN</name>
     <description>M31_PHY_LS_EN</description>
     <addressOffset>0x450</addressOffset>
    </register>
    <register>
     <name>M31_PHY_DEBUG_SEL</name>
     <description>M31_PHY_DEBUG_SEL</description>
     <addressOffset>0x454</addressOffset>
    </register>
    <register>
     <name>M31_PHY_DEBUG_OUT</name>
     <description>M31_PHY_DEBUG_OUT</description>
     <addressOffset>0x458</addressOffset>
    </register>
    <register>
     <name>M31_PHY_OUTCLKSEL</name>
     <description>M31_PHY_OUTCLKSEL</description>
     <addressOffset>0x45C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGI_31_0</name>
     <description>M31_PHY_XCFGI_31_0</description>
     <addressOffset>0x460</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGI_63_32</name>
     <description>M31_PHY_XCFGI_63_32</description>
     <addressOffset>0x464</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGI_95_64</name>
     <description>M31_PHY_XCFGI_95_64</description>
     <addressOffset>0x468</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGI_127_96</name>
     <description>M31_PHY_XCFGI_127_96</description>
     <addressOffset>0x46C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGI_137_128</name>
     <description>M31_PHY_XCFGI_137_128</description>
     <addressOffset>0x470</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_HS_COARSE_TUNE_NUM</name>
     <description>M31_PHY_XCFG_HS_COARSE_TUNE_NUM</description>
     <addressOffset>0x474</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_HS_FINE_TUNE_NUM</name>
     <description>M31_PHY_XCFG_HS_FINE_TUNE_NUM</description>
     <addressOffset>0x478</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_FS_COARSE_TUNE_NUM</name>
     <description>M31_PHY_XCFG_FS_COARSE_TUNE_NUM</description>
     <addressOffset>0x47C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_FS_FINE_TUNE_NUM</name>
     <description>M31_PHY_XCFG_FS_FINE_TUNE_NUM</description>
     <addressOffset>0x480</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_LOCK_RANGE_MAX</name>
     <description>M31_PHY_XCFG_LOCK_RANGE_MAX</description>
     <addressOffset>0x484</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGI_LOCK_RANGE_MIN</name>
     <description>M31_PHY_XCFGI_LOCK_RANGE_MIN</description>
     <addressOffset>0x488</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_OB_RSEL</name>
     <description>M31_PHY_XCFG_OB_RSEL</description>
     <addressOffset>0x48C</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFG_OC_RSEL</name>
     <description>M31_PHY_XCFG_OC_RSEL</description>
     <addressOffset>0x490</addressOffset>
    </register>
    <register>
     <name>M31_PHY_XCFGO</name>
     <description>M31_PHY_XCFGO</description>
     <addressOffset>0x494</addressOffset>
    </register>
    <register>
     <name>MXM_INT</name>
     <description>USB Added Maxim Interrupt Flag Register.</description>
     <addressOffset>0x498</addressOffset>
     <fields>
      <field>
       <name>VBUS</name>
       <description>VBUS</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>NOVBUS</name>
       <description>NOVBUS</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MXM_INT_EN</name>
     <description>USB Added Maxim Interrupt Enable Register.</description>
     <addressOffset>0x49C</addressOffset>
     <fields>
      <field>
       <name>VBUS</name>
       <description>VBUS</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
      <field>
       <name>NOVBUS</name>
       <description>NOVBUS</description>
       <bitOffset>1</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MXM_SUSPEND</name>
     <description>USB Added Maxim Suspend Register.</description>
     <addressOffset>0x4A0</addressOffset>
     <fields>
      <field>
       <name>SEL</name>
       <description>Suspend register</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
    <register>
     <name>MXM_REG_A4</name>
     <description>USB Added Maxim Power Status Register</description>
     <addressOffset>0x4A4</addressOffset>
     <fields>
      <field>
       <name>VRST_VDDB_N_A</name>
       <description>VRST_VDDB_N_A</description>
       <bitOffset>0</bitOffset>
       <bitWidth>1</bitWidth>
      </field>
     </fields>
    </register>
